# RoomEditElectricalLoadsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomEditElectricalLoadsParam Property
ParameterTypeId Class See Also
---
"Electrical Loads"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomEditElectricalLoadsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomEditElectricalLoadsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomEditElectricalLoadsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace